In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/Combined_DS_v10.csv')
df.head()

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/2018 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/2018 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/2018 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/2018 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/2018 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"

In [3]:
countries = df['Country']
country_counts = countries.value_counts()

In [4]:
country_counts

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Ukraine           9
Ireland           5
Name: Country, dtype: int64

In [6]:
country_counts[country_counts < 10].index

Index(['Ukraine', 'Ireland'], dtype='object')

In [8]:
mask = countries.isin(country_counts[country_counts < 10].index)

In [9]:
df['Country'][mask] = 'Other'

c:\program files\python36\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [10]:
df.head(20)

,SurveyDate,FormalEducation,ConvertedSalary,Hobby,Country,StackOverflowJobsRecommend,VersionControl,Age,Years Experience,Gender,RawSalary
0,2/28/2018 20:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,South Africa,NaN,Git,21,13,Male,NaN
1,6/28/2018 13:26,Bachelor's degree (BA. BS. B.Eng.. etc.),70841.0,Yes,Sweeden,7.0,Git;Subversion,38,9,Male,"70,841.00"
2,6/6/2018 3:37,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,Sweeden,8.0,Git,45,11,NaN,NaN
3,5/9/2018 1:06,Some college/university study without earning ...,21426.0,Yes,Sweeden,NaN,Zip file back-ups,46,12,Male,"21,426.00"
4,4/12/2018 22:41,Bachelor's degree (BA. BS. B.Eng.. etc.),41671.0,Yes,UK,8.0,Git,39,7,Male,"£41,671.00"
5,2/9/2018 19:09,Some college/university study without earning ...,120000.0,Yes,Russia,7.0,Git,39,2,Male,"120,000.00"
6,5/25/2018 6:11,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,UK,NaN,Git,34,11,Male,NaN
7,10/16/2018 23:36,Some college/university study without earning ...,250000.0,Yes,France,7.0,Git,24,2,Female,"250,000.00"
8,10/7/2018 22:14,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,No,South Africa,10.0,Git,23,17,Male,NaN
9,2/24/2018 21:36,Secondary school (e.g. American high school. G...,0.0,No,France,NaN,Copying and pasting files to network shares,36,2,NaN,0
10,5/25/2018 22:10,Master's degree (MA. MS. M.Eng.. MBA. etc.),47904.0,Yes,Spain,6.0,Git,26,0,NaN,"47,904.00"
11,8/3/2018 18:31,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,USA,10.0,Git,42,0,NaN,NaN
12,10/20/2018 17:35,Bachelor's degree (BA. BS. B.Eng.. etc.),95968.0,Yes,India,6.0,Git,18,16,NaN,"95,968.00"
13,7/23/2018 10:20,Bachelor's degree (BA. BS. B.Eng.. etc.),NaN,Yes,USA,7.0,Git;Subversion,31,14,NaN,NaN
14,7/2/2018 18:25,Bachelor's degree (BA. BS. B.Eng.. etc.),420.0,No,Other,NaN,Copying and pasting files to network shares,21,8,Male,420
15,10/9/2018 23:49,Some college/university study without earning ...,75000.0,Yes,UK,5.0,Git,22,8,NaN,"£75,000.00"
16,8/29/2018 1:49,Master's degree (MA. MS. M.Eng.. MBA. etc.),10958.0,Yes,UK,10.0,Git,41,10,NaN,"£10,958.00"
17,8/21/2018 10:48,Master's degree (MA. MS. M.Eng.. MBA. etc.),51408.0,Yes,USA,9.0,Git;Subversion,55,1,Male,"$51,408.00"
18,4/17/2018 21:23,Master's degree (MA. MS. M.Eng.. MBA. etc.),72611.0,Yes,USA,5.0,Git,31,10,Female,"$72,611.00"
19,9/3/2018 19:11,Bachelor's degree (BA. BS. B.Eng.. etc.),900000.0,No,Spain,1.0,Team Foundation Version Control,39,10,NaN,"900,000.00"

In [11]:
df['Country'].value_counts()

South Africa    166
USA             164
Spain           134
Sweeden         119
France          115
Russia           97
UK               95
India            95
Other            14
Name: Country, dtype: int64

In [12]:
# tạo cột Paid_Job chỉ có 2 giá trị là 1: có trả tiền và 0: không trả tiền
df['Paid_Job'] = 0
df.loc[df['ConvertedSalary'] > 0, 'Paid_Job'] = 1

In [14]:
df[['Paid_Job', 'ConvertedSalary']].head()

   Paid_Job  ConvertedSalary
0         0              NaN
1         1          70841.0
2         0              NaN
3         1          21426.0
4         1          41671.0

## Binning Value

In [15]:
df['equal_bin'] = pd.cut(df['ConvertedSalary'], bins=5)

In [16]:
df[['equal_bin', 'ConvertedSalary']].head()

             equal_bin  ConvertedSalary
0                  NaN              NaN
1  (-2000.0, 400000.0]          70841.0
2                  NaN              NaN
3  (-2000.0, 400000.0]          21426.0
4  (-2000.0, 400000.0]          41671.0

In [17]:
df['equal_bin'].unique()

[NaN, (-2000.0, 400000.0], (800000.0, 1200000.0], (400000.0, 800000.0], (1600000.0, 2000000.0]]
Categories (4, interval[float64]): [(-2000.0, 400000.0] < (400000.0, 800000.0] < (800000.0, 1200000.0] < (1600000.0, 2000000.0]]

In [18]:
df['equal_bin'].value_counts()

(-2000.0, 400000.0]       645
(800000.0, 1200000.0]       9
(400000.0, 800000.0]        6
(1600000.0, 2000000.0]      5
(1200000.0, 1600000.0]      0
Name: equal_bin, dtype: int64

In [19]:
df['ConvertedSalary'].min(), df['ConvertedSalary'].max()

(0.0, 2000000.0)

In [20]:
import numpy as np

In [21]:
my_bins = [-np.inf, 10000, 50000, 100000, 150000, np.inf]

In [22]:
my_labels = ['Very low', 'Low', 'Medium', 'High', 'Very high']

In [23]:
df['boundary_bin'] = pd.cut(df['ConvertedSalary'], bins=my_bins, labels=my_labels)

In [24]:
df[['boundary_bin', 'ConvertedSalary']].head()

  boundary_bin  ConvertedSalary
0          NaN              NaN
1       Medium          70841.0
2          NaN              NaN
3          Low          21426.0
4          Low          41671.0

In [25]:
df['boundary_bin'].unique()

[NaN, Medium, Low, High, Very high, Very low]
Categories (5, object): [Very low < Low < Medium < High < Very high]

In [26]:
df['boundary_bin'].value_counts()

Medium       232
Low          224
High          89
Very low      78
Very high     42
Name: boundary_bin, dtype: int64